let data = [
    "07 أصحاب الفيل 02.mp4	",
    " 10- قصة بقرة بني اسرائيل.mp4	",
    "أفضل فلم وثائقي يشرح حياة الرسول منذو ولادتة الى وفاتة.mp4	",
    "فتح الاندلس ( طارق بن زياد ) كامل.mp4	",
    "قصة أصحاب السبت وشملون اللعين.mp4	",
    "    قصة أمير المؤمنين علي بن أبي طالب مع عمرو بن عبد ود.mp4	",
    "    قصة التابوت وجالوت الظالم وداوود الحكيم.mp4	",
    "    قصة التاجر والشيطان القبيح.mp4	",
    "    قصة الحمال الطيب وسرّ نجاته من الموت.mp4	",
    "    قصة الغلام الصالح والملك الظالم وأصحاب الأخدود.mp4	",
    "    قصة الفقير الخائن لعهد الله بعد أن أصبح غنياً.mp4	",
    "    قصة الوزير وسؤاله ما هو أفضل شيء يمتلكه الإنسان.mp4	",
    "    قصة سيدنا ادريس علية السلام.mp4	",
    "    قصة سيدنا اسماعيل عليه السلام قصص الأنبياء صلصال.mp4	",
    "    قصة سيدنا داود عليه السلام.mp4	",
    "    قصة سيدنا عزير عليه السلام قصص الأنبياء صلصال.mp4	",
    "    قصة سيدنا محمد عليه الصلاة والسلام (Full movie in one video).mp4	",
    "قصة سيدنا موسى عليه الصلاة والسلام.mp4	",
    "قصة سيدنا هود عليه السلام قصص الأنبياء صلصال.mp4	",
    "    قصة صاحب البستان الكريم وأولاده الحمقى.mp4	",
    "    قصة عن عدل امير المؤمنين عليه السلام.mp4	",
    "    قصة قارون المغرور وكنوزه الكثيرة.mp4	",
    "    قصة قرية المفسدين وأصحاب الرس.mp4	",
    "    قصة لقمان الحكيم ومكر الشياطين وفيه مشاهد مرعبة مؤثرة.mp4	",
    "    قصة مملكة سبأ وسبب هلاكها.mp4	",
    "    قصص الأنبياء ( سيدنا إسماعيل - عليه السلام ) كامله وبجودة عالية ...mp4	",
    "    قصص الأنبياء للأطفال - اسماعيل عليه السلام.mp4	",
    "    قصص القرآن الكريم للأطفال - أصحاب الأخدود.mp4	",
    "قصص القرآن الكريم للأطفال - أهل الكهف.mp4	",
    "    قصص القرآن الكريم للأطفال - صاحب الجنتين.mp4	",
    "    قصص القرآن الكريم للأطفال - طالوت وجالوت.mp4	",
    "    قصص القرآن الكريم للأطفال - غراب قابيل وهابيل.mp4	",
    "    قصص القرآن الكريم للأطفال - قصة عزير.mp4	",
    "    قصص القرآن الكريم للأطفال - قصة قارون.mp4	",
    "    قصص القرآن الكريم للأطفال - مؤمن آل فرعون.mp4	",
    "    قصص القران بالصلصال اصحاب السبت.mp4	",
    "    قصص القران للاطفال رسوم متحركة اسلامية هادفة.mp4	",
    "قصه نمل نبي الله سليمان (ع).mp4	",
    "    كرتون ٱطفال ـ قصة سيدنا ذو الكفل عليه السلام.mp4	",
    "    محمد خاتم الأنبياء.mp4	",
    "من روائع قصص الأطفال قصة الملك العادل ذ و القرنين.mp4	",
    "    نبي الله ابراهيم قصص الآنبياء.mp4	",
    "نبي الله صالح عليه السلام.mp4"
]

const list = document.getElementById('list_of_films')
let video  =document.querySelector('.videios_film>video')

data.map(e=>{
    let option = document.createElement('option')
    option.value = e
    option.innerHTML =e
    list.appendChild(option)
}
)

list.addEventListener('change',()=>{
video.src ='https://dn720402.ca.archive.org/0/items/20200807_20200807_0118/'+ list.value.trim()
})